Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/M06.tmx
Source language: en_us
Languages: zh_cn

source: Paris, at Night
zh_cn: 夜·巴黎

source: Today was rice day, fifty-pound sacks of white rice in trucks bearing an elephant logo.
zh_cn: 今天是大米日，每袋五十磅的白大米装在带有大象标志的卡车上。

source: The same happy elephant appeared on the bags, its head raised to the sky, the trunk curved like an S.
zh_cn: 同样快乐的大象也出现在袋子上，它的头昂向天空，鼻子弯曲成一个S型。

source: "Elephant," Todd said.
zh_cn: “大象，”托德（Todd）说。

source: He said it because a laborer was staring at it intently. Which meant he wasn't working.
zh_cn: 他这么说是因为一个工人正目不转睛地注视着它，这表示他没在工作。

source: "That's right," the man said. "I couldn't remember the word."
zh_cn: “你说的对，”那个人说，“我想不起那个词了。”

source: He was the only other human at the loading dock this morning. The man didn't have a name, just a number, like the rest of the robots.
zh_cn: 他是这个上午在装卸码头上的唯一的另一个人类，这个人没有名字，只有一个代号，就像其他的机器人一样。

source: "Let's get back to it, 8831, okay?"
zh_cn: “我们回到工作上吧，8831，好吧？”

source: "Yessir," the man said.
zh_cn: “好的，先生，”那个人说。

source: That could be me, Todd thought as he watched him work side by side with his silent mechanical counterparts, lifting, carrying, and dropping bags of rice from the back of the truck to the warehouse.
zh_cn: 我可能也会是这样，看着他与沉默的机械同行们肩并肩一起工作，从卡车后面到仓库抬起、搬运、放下一袋袋大米时托德心想。

source: A bad car accident, a bad fall from a ladder, and that could be me.
zh_cn: 一场严重的车祸、从梯子上重重摔下，我可能也会成这样。

source: Or a bad memrip.
zh_cn: 或者一个失败的记忆移植手术。

source: AT LUNCH, Todd thought of things he could sell.
zh_cn: 午餐时，托德考虑了一下他能够卖的物品。

source: Everything he owned of any value, he could touch: his grandfather's watch, his grandmother's wedding ring, a gold necklace belonging to some forgotten relative.
zh_cn: 任何他拥有的值钱的东西，他能动用的：他祖父的手表、他祖母的结婚戒指、一条属于某个被遗忘的亲戚的金项链。

source: His car, too, but that was out of the question as he needed it to work.
zh_cn: 还有他的车，但那是不可能的，因为他还需要它来工作。

source: He got up from his chair and scanned the floor below, the robots still working away, a sea of metallic shoulders rising and falling in unison, strangely beautiful in a way.
zh_cn: 他从椅子上站起来，看了一眼楼下，机器人还在远处工作，一片金属肩膀组成的海洋同时起落，从某个角度来看有一种奇异的美。

source: Over by the forklift sat 8831, his eyes as blank as the piece of bread he was eating.
zh_cn: 在另一边铲车旁坐着8831，他的眼睛和他正在吃的那片面包一样空白无味。

source: Two weeks from today was Todd's thirtieth wedding anniversary, and even if he were to pawn the watch, the ring, and the necklace, he knew he wouldn't even come close to having enough for Paris.
zh_cn: 再过两个星期就是托德的结婚三十周年纪念日，即便典当了手表、戒指和项链，他知道他也不会接近有足够的钱去巴黎。

source: That's where Sue had wanted to go for as long as he could remember.
zh_cn: 那是苏（Sue）很久以来都想要去的地方，他能记得有多久就有多久了。

source: They didn't have the money to honeymoon there, but that was okay because back then, there had been plenty of time.
zh_cn: 他们没有去那里度蜜月的钱，但那没什么，因为在当时，有大把的时间。

source: They were young, both healthy and working, so they would save a little here and there and in a couple of years, they would be walking up to the Eiffel Tower at night arm in arm, find themselves underneath the arch and look up at the beacon that shined on this city of lights.
zh_cn: 他们年纪尚轻，两个人都健康勤劳，所以他们这里那里节省一点，几年后，他们就会在晚上挽着胳膊走向埃菲尔铁塔，发现自己在拱顶下仰着头看向照耀着这个灯光之城的灯塔。

source: But then came two sons and three recessions and a second mortgage.
zh_cn: 但是随后有了两个儿子，三次大萧条和一个二次抵押贷款。

source: A hysterectomy for her, a double bypass for him, and now here he was, nine years short of retirement, supervising a team of robots and a retarded man, thinking about folks who could sell things they couldn't touch, like stocks and bonds and whatever else he couldn't even fathom, people with money who would pay to experience another's most cherished moments.
zh_cn: 她做了一次子宫切除手术，他的心脏做了两个搭桥，现在他在这儿，再有九年就退休了，管理着一队机器人和一个智力迟钝的男人，想着能够出售他们动不了的东西的人们，比如股票、债券以及其他任何他甚至都理解不了的东西，想着愿意花钱体验别人最珍爱的时刻的有钱人。

source: Silly.
zh_cn: 愚蠢。

source: That would be Sue's word for it if this were a story she'd overheard.
zh_cn: 如果这是苏偶然听到的一个故事，这将是她对此的评价。

source: For a trip, a goddamn trip, what a silly thing to do.
zh_cn: 为了一次旅行，一次该死的旅行，干这么蠢的事啊。

source: But it was more than a trip. It was their life together.
zh_cn: 但这不仅仅是一次旅行，这是他们一起的生活。

source: There was life and there was death, and it seemed to Todd that if he waited any longer, there wouldn't be a difference between the two.
zh_cn: 有生，有死，但在托德看来如果他再等下去，这两者之间也不会有差别。

source: He opened the filing cabinet and rifled through the folders.
zh_cn: 他打开文件柜，在文件夹中搜索。

source: In all the years he'd been here, only a handful of human workers had come and gone.
zh_cn: 他在这里的这些年，只有少数几个人类工人来来去去。

source: All of them were handicapped in some way; they came through the city welfare program, and 8831 was no exception.
zh_cn: 他们所有人在某方面都有残疾；他们是通过城市福利计划来的，8831也不例外。

source: Name: Lopez, Manny
zh_cn: 姓名：洛佩兹，曼尼（Lopez, Manny）

source: Age: 46
zh_cn: 年龄：46

source: Tax Status: Married
zh_cn: 纳税身份：已婚

source: Disability: Neural Trauma
zh_cn: 伤残：神经损伤

source: Neural Trauma.
zh_cn: 神经损伤。

source: It was worth a shot.
zh_cn: 值得一试。

source: Manny's wife picked up on the second ring.
zh_cn: 曼尼的妻子在第二声铃响时接听了电话。

source: Todd told her who he was, and after he assured her that her husband was not hurt, he was fine, he was a great worker, he asked her what he wanted to know.
zh_cn: 托德告诉她他是谁，在他向她保证她丈夫没有受伤、他没事儿、他是一个很好的工人之后，他向她询问他想知道的事。

source: She listened without interrupting him, then there was a lengthy silence.
zh_cn: 她听着，没有打断他，然后是长时间的沉默。

source: "Why?" she asked.
zh_cn: “为什么？”她问。

source: "Does it matter?"
zh_cn: “有关系吗？”

source: "I can report you."
zh_cn: “我可以举报你。”

source: "I know."
zh_cn: “我知道。”

source: More silence.
zh_cn: 再次沉默。

source: "He did it because he loved me.
zh_cn: “他那么做是因为那时他爱我。

source: Loved," she said, hardening. "Not loves."
zh_cn: 那时爱，”她说，语气加强，“不是现在爱。”

source: "I heard you."
zh_cn: “我明白你的意思。”

source: Then she hung up on him, and for the rest of the day, Todd replayed the conversation in his mind.
zh_cn: 然后她挂断了电话，那一天余下的时间里，托德在他脑子里重复播放这次谈话。

source: Should he have lied to her, made up some story about a sick mother, a dying child? He wasn't good at talking, especially on the phone.
zh_cn: 他是不是应该对她撒谎，编造一些关于一个患病的母亲、一个垂死的孩子的故事？他不擅长谈话，特别是在电话里。

source: People thought he was unfriendly, hostile.
zh_cn: 人们认为他不友好，充满敌意。

source: A woman once told him his voice sounded like broken stones rattling in a cage.
zh_cn: 一个女人曾经告诉他他的声音听上去像是破碎的石头在升降车里嘎嘎地响。

source: The horn blared at five, time for the two humans to go home and the robots to be reconditioned and put in standby.
zh_cn: 五点钟铃响了，到两个人类回家及机器人修整待用的时间了。

source: Todd was walking out to his car when Manny touched his shoulder.
zh_cn: 托德正向外走向他的车，这时曼尼碰碰他的肩。

source: "Boss," he said, sounding uncertain.
zh_cn: “老板，”他说，声音听上去不确定。

source: He held out his phone. "My wife, she wants to talk to you?"
zh_cn: 他递出他的电话，“我妻子，她想和你说话？”

source: THE HOUSE was quiet when he returned, and it seemed to Todd that he wanted to keep it that way.
zh_cn: 他回来时房子很安静，而托德似乎也想要它保持这个样子。

source: Take small, measured steps, like a thief. He carefully pulled the door shut, holding onto the doorknob and turning it by hand until it locked.
zh_cn: 迈着小而仔细的步子，像个贼一样，他小心地拉上门，握着门把手，用手转着把门锁上。

source: Above, the floorboards creaked, Sue's footsteps as she walked from their bedroom to the bathroom.
zh_cn: 上面，地板咯吱作响，苏从他们的卧室走向洗手间的脚步声。

source: Then a flush, and the trill of water climbing up to refill the toilet tank.
zh_cn: 然后是冲水声，和水升上去装满马桶水箱的颤动声。

source: And now the muffled voice of the late-show host on TV, the encouraging laughter of the studio audience, the one-two punch repeating until they cut to commercial.
zh_cn: 现在是电视上夜间秀节目主持人被压低的声音、演播室观众鼓励的笑声，两者连续反复直到他们切入广告。

source: Todd sat at the dining table and peeked inside the microdome, at the plate Sue had made for him.
zh_cn: 托德坐在餐桌旁，朝保鲜罐里瞥了一眼，看看苏给他做的一盘饭菜。

source: Pork chops, a bunch of broccoli spears, a hill of mashed potatoes with a well of gravy.
zh_cn: 猪排、一大堆西兰花、堆成小山的浓肉汁土豆泥。

source: He touched the REHEAT button and watched his plate spin slowly, the inside of the dome steaming up.
zh_cn: 他轻轻按下“加热”按钮，看着他的盘子慢慢地转动，罐子里面升起蒸汽。

source: One thing for sure, my clients never tire of wedding proposals.
zh_cn: 有一点是肯定的，我的客户对求婚从不厌倦。

source: The man Todd had met after work was funny, friendly, utterly normal.
zh_cn: 托德下班后见的那个男人风趣、友好、完全正常。

source: It didn't seem possible that they were talking about something that could land both of them a minimum of two years in prison.
zh_cn: 看上去他们不可能是在谈论一些能使他们两个在监狱中至少关两年的事。

source: I'm not going to lie to you, Todd.
zh_cn: 我不打算对你说谎，托德。

source: There's a risk to this.
zh_cn: 这个有风险。

source: People do get hurt, like your friend Manny.
zh_cn: 确实有人受伤，比如你的朋友曼尼。

source: But keep in mind that Manny didn't follow our simple yet extremely important directions.
zh_cn: 但要记得曼尼是没有遵循我们简单却极为重要的指示。

source: We told him over and over again that he wasn't to consume any alcoholic beverages twenty-four hours before the procedure.
zh_cn: 我们一再告诉他事前二十四小时内不要饮用任何含酒精饮料。

source: We even hired a Portuguese translator to make sure he understood what was required of him.
zh_cn: 我们甚至请了一位葡萄牙语翻译以确保他明白对他的要求。

source: See, this is why Mrs. Lopez still led you to us, because she knows we do good work.
zh_cn: 看看，这就是为什么洛佩兹太太还要把你引荐给我们，因为她知道我们的工作做得好。

source: Her cousin's a regular sourcer, comes in once a month, has been for years.
zh_cn: 她表弟是一个定期的供应源，一个月来一次，都好几年了。

source: We don't mess up, Todd.
zh_cn: 我们不会搞砸的，托德。

source: It's the sourcers who mess up.
zh_cn: 是供应源自己搞砸的。

source: And I can see we'll have a smooth ride, because you're a smart guy.
zh_cn: 我相信我们会顺利进行的，因为你是个聪明人。

source: Though he introduced himself as Richard Gibbons, he also immediately admitted that it was an alias.
zh_cn: 尽管他自我介绍叫理查德·吉布斯（Richard Gibbons），他还是立即承认那是化名。

source: In my opinion, Todd? In my opinion, I think it's something the government should regulate.
zh_cn: 在我看来，托德，在我看来，我认为这是政府应该管理的。

source: Because let's face it, everybody's doing it.
zh_cn: 因为让我们正视这件事，每个人都在这么做。

source: But think how long it took for marijuana to become legalized.
zh_cn: 但是想想大麻合法化用了多长时间。

source: Hell, it's still not legal in Alabama.
zh_cn: 我靠，在阿拉巴马州还是不合法的。

source: Todd opened the microdome and took out the plate.
zh_cn: 托德打开保鲜罐，拿出盘子。

source: The pork had gotten a little tougher, but it still tasted wonderful, his wife's signature flavors of mint and garlic in every bite.
zh_cn: 猪肉有点硬了，但味道还是很好，每一口都有他妻子特有的薄荷和蒜香味。

source: The way I see it, you're getting peak value for something that is going to eventually disappear.
zh_cn: 我觉得，你对某些最终要消失的东西赋予了最高的价值。

source: I'm not just talking about Alzheimer's.
zh_cn: 我不只是在谈老年痴呆症。

source: Once you go past sixty, memories fade at an alarming clip.
zh_cn: 人一过六十岁，记忆就以惊人的速度衰退。

source: It's what happens because the brain can only retain so much.
zh_cn: 这是因为大脑只能保留这么多。

source: Like all of our other organs, it's about usage.
zh_cn: 像我们所有的其他器官一样，这和用量有关。

source: When was the last time you thought about your honeymoon?
zh_cn: 你最后一次想起你的蜜月是什么时候？

source: Honestly?
zh_cn: 坦白说？

source: The less you use, the more you lose.
zh_cn: 你用得越少，你失去的就越多。

source: It's the foundation of how our bodies work.
zh_cn: 这是我们身体运转的根本。

source: The health benefits of memripping, they're not some urban legend.
zh_cn: 记忆移植对健康有益，这不是某些都市传奇。

source: You're cleaning house. You're taking out the garbage and putting in out on the curb, but here's the difference: you're getting paid for that trash.
zh_cn: 你是在打扫房子，你拿出垃圾，倒在路边，但区别是：你因为那些垃圾而得到了报酬。

source: It was a painless, quick procedure.
zh_cn: 这个过程没有痛苦，快速也快。

source: All you had to do was remember what you wanted to have ripped while the machine was plugged into you.
zh_cn: 你所要做的就是在机器插入你身体时记得你想要分离的东西。

source: The surgery was completely automated and technologically sound.
zh_cn: 手术完全是自动化的，技术可靠。

source: Memory is free.
zh_cn: 记忆是免费的。

source: Not for our clients, of course, haha!
zh_cn: 当然对我们的客人来说不是的，哈哈！

source: But for you, Todd.
zh_cn: 但对你来说是的，托德。

source: Think of all the new memories you'll create with the money you'll have.
zh_cn: 想想用你即将得到的钱去创造的所有的新记忆。

source: Our government wants to equate our enterprise to organ trafficking, but nothing could be further from the truth.
zh_cn: 我们政府想要把我们的事业等同于器官交易，但事情远非如此。

source: You grow memory like a crop, and when you want to, you harvest it.
zh_cn: 你像种庄稼一样种植记忆，在你想要的时候，你就收割。

source: Are there people picketing against farmers every time they cut down a bushel of corn?
zh_cn: 每次农民砍倒几升玉米时有人抗议他们吗？

source: Of course not.
zh_cn: 当然没有。

source: It's natural. It's life.
zh_cn: 这是自然的，这是生活。

source: "Todd?"
zh_cn: “托德？”

source: Sue met him at the sink.
zh_cn: 苏在水槽那儿见到他。

source: She reached for the dish towel hanging off the hook, but Todd angled his body to block her.
zh_cn: 她伸手去拿挂在钩子上的擦碗布，但托德扭身挡住了她。

source: "It's just one dish," he said. "You can let it dry."
zh_cn: “就一个盘子，”他说，“让它自己风干吧。”

source: "You had a long day."
zh_cn: “你累了一整天了。”

source: Todd wiped his hands on the towel and turned around to face her.
zh_cn: 托德用毛巾擦擦手，转过身面向她。

source: Even though she looked prettier with her makeup on, he also liked seeing his wife like this, right before they went to bed, because only he saw her like this.
zh_cn: 即使她化上妆看起来更漂亮，他还是喜欢看到他妻子现在这个样子，就在他们上床以前的样子，因为只有他看到她这个样子。

source: Nobody else in the world knew this Sue, only him.
zh_cn: 世上没有其他人知道这个苏，只有他。

source: Though it was possible that wouldn't be true after the memrip.
zh_cn: 尽管在记忆移植之后这可能不会是真的了。

source: But was that a bad thing?
zh_cn: 但那是一件坏事吗？

source: Was it so terrible to share his love for his wife with someone else?
zh_cn: 与他人分享他对妻子的爱有这么可怕吗？

source: Todd waited to turn off the kitchen lights, for Sue to switch on the lamp at the landing of the staircase.
zh_cn: 托德等着关掉厨房的灯，等着让苏打开楼梯底部的灯。

source: It was their unspoken routine to retire to their bedroom.
zh_cn: 这是他们回卧室就寝时不用说出口的惯例。

source: There were many other small routines like that one, and now, as he climbed the stairs with her, Todd thought how wonderful it was to know another person so well, that this was comfort, that this was home.
zh_cn: 还有很多其他和这个一样的小惯例，现在，在他和她一起爬楼梯时，托德想这么了解另一个人是多么美好啊，这就是舒适，这就是家。

source: TRIANGULAR BOXES.
zh_cn: 三角形的箱子。

source: That was the shipment that waited for him when he arrived at work the following morning.
zh_cn: 这是第二天早上上班时等着他的货物。

source: There were blue ones and red ones and yellow ones and green ones, and each contained a like-colored chair from a Korean designer.
zh_cn: 有蓝色的、红色的、黄色的、绿色的，每一个都装有一把由一个韩国设计师设计的同色的椅子。

source: Todd couldn't see how a box like that could hold a comfortable chair, so he opened one up and sat in it.
zh_cn: 托德不明白那样的箱子如何装得下一把舒服的椅子，所以他打开了一个，坐上去。

source: "Jesus Christ," he said.
zh_cn: “天哪，”他说。

source: Four auto-adjusting palm-shaped prongs supported him in ways that seemed impossible: his lower back, his love handles, and his neck.
zh_cn: 四个自动调节的手掌形叉子以似乎不可能的方式支撑着他：他的后腰、他腰上的赘肉，还有他的脖子。

source: If he had his way, he would sit here forever.
zh_cn: 如果他能想怎样就怎样，他会永远地坐在这里。

source: But he couldn't, as the whistle blew and the robots came to life.
zh_cn: 但他不能，因为哨子吹响了，机器人复活了。

source: He thought the oddly-shaped boxes might pose a challenge for them, but they didn't miss a step.
zh_cn: 他想这些奇形怪状的箱子可能会对它们造成挑战，但它们一步也没错。

source: The robots saw the way the boxes were stacked inside the truck, right side up and upside down, staggered to maximize space, and they replicated the exact pattern in the warehouse.
zh_cn: 机器人看到箱子在卡车里的堆叠方式，正面朝上、颠倒朝下，交错排列以最大限度地利用空间，它们在仓库里复制同样的模式。

source: Manny worked in perfect tandem with his mechanized brothers as the morning turned into afternoon.
zh_cn: 从早上到下午，曼尼与他的机械兄弟们完美地配合着工作。

source: Like yesterday, he went back to the forklift to eat his lunch, and Todd wondered if perhaps he used to run one of those.
zh_cn: 和昨天一样，他回到铲车那里吃午餐，托德怀疑或许他曾经开过其中一辆。

source: He considered asking him but changed his mind.
zh_cn: 他想着问问他但又改了主意。

source: If Manny did so before, he certainly didn't now, so what was there to talk about?
zh_cn: 如果曼尼以前开过，那他现在确实不开了，那么还有什么好谈的？

source: In his office, Todd dug into the brown paper bag of his own lunch and thought that today was very much like yesterday, and the day before that, and the day before that.
zh_cn: 在他办公室里，托德大口吃着褐色纸袋里他自己的午餐，想到今天和昨天非常相似，前天也是，再前一天也是。

source: But tomorrow would be different because tonight would be different.
zh_cn: 但明天将会不同，因为今夜将会不同。

source: If the memrip went according to plan- and he had no reason to believe it wouldn't, because he hadn't had a beer in the last twenty-four hours, hadn't washed his hair this morning, followed everything Gibbons had told him- tomorrow he would call up that travel agent who advertised in the paper and tell her to book the platinum romantic getaway to Paris for two.
zh_cn: 如果记忆移植按计划进行——而他也没理由认为不会，因为他在过去二十四小时内没有喝过一杯啤酒，今天早上没有洗头，遵照吉布斯告诉他的所有事——明天他要打电话给在报纸上打广告的旅行社，叫她预订到巴黎的双人白金浪漫之旅。
